describe("非同期処理", () => {
  describe("wait", () => {
    test("指定時間待つと、経過時間をもって resolve される", () => {});
    test("指定時間待つと、経過時間をもって resolve される", () => {});
    test("指定時間待つと、経過時間をもって resolve される", () => {});
    test("指定時間待つと、経過時間をもって resolve される", () => {});
  });
  describe("timeout", () => {
    test("指定時間待つと、経過時間をもって reject される", () => {});
    test("指定時間待つと、経過時間をもって reject される", () => {});
    test("指定時間待つと、経過時間をもって reject される", () => {});
  });
});

test("指定時間待つと、経過時間をもって reject される", () => {});

test("return していないため、Promise が解決する前にテストが終了してしまう", () => {});
